app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def show
    @student = Student.where(id: params[:id])